{
    "posts": [
        {
            "title": "Machete assailant suspect had 11 prior arrests before killing coworker, police say",
            "content": "NORTH CHARLESTON, S.C. (WCIV) — The Coroner has identified the man killed in a machete attack Wednesday.\n\nDavid Carter, 57, died after North Charleston, and police say Tyrone Campbell attacked him with a machete at a job site.\n\nThis is not the first time Campbell has been arrested.\n\nCourt records show Campbell has been arrested at least 11 times, four of those were here in South Carolina.\n\nBACKGROUND | \"Coroner ID's man hacked to death by machete-wielding suspect in North Charleston.\"\n\nPromoted Links\nIf you own a mouse, play it for 1 minute.\nCombatSiege\nLocally, he’s been arrested in Berkeley, Dorchester, and Orangeburg counties.\n\nState Law Enforcement Division documents show Campbell has previously been charged with arson/assault, attempted murder, and unlawful carry of a weapon.\n\nAccording to an incident report from the Orangeburg County Sheriff’s Office in June 2021, Campbell was already in jail facing arson charges.\n\nDeputies received a call about an aggravated assault and learned Campbell tried to choke his cellmate.\n\nThe report says when the victim was asleep, Campbell took his shoes off, ran, and jumped on the victim’s ribs.\n\nThen deputies say the video shows Campbell putting the victim in a chokehold.\n\nThe victim tried to fight back, but he eventually went unconscious.\n\nDeputies say when they questioned Campbell, he told them the victim was fake sleeping and snoring, which annoyed him.\n\nBACKGROUND | \"Victim hacked to death with machete at construction site; co-worker arrested: NCPD.\"\n\nIt’s unclear when Campbell was released from jail, but News 4 does know he was on parole when police arrested him on murder charges.\n\n“From what we understand from witnesses, once the victim was pushed to the ground, he just took the machete out and started assaulting him with it. So, it was a repeated assault with the machete,” said Deputy Chief Karen Cordray with the North Charleston Police Department on Wednesday.\n\nOfficers say when they got on the scene, Campbell wouldn’t cooperate.\n\n“Our officers confronted him and told him to get to the ground, dropped to the ground. He refused to listen. He then pulled the machete out of a bag he had that he was carrying. And as he pulled the machete out and turned to the officers, they ended up using the tasers to take him into custody,” Deputy Chief Cordray added.\n\nThe incident report released Thursday says David Carter had multiple lethal lacerations to his face, arms, and head.\n\nNews 4 is waiting to receive incident reports from Campbell’s previous arrests that were requested under the Freedom of Information Act.",
            "comments": [
                {
                    "username": "trung",
                    "comment": "poor man"
                },
                {
                    "username": "trung",
                    "comment": "R.I.P"
                },
                {
                    "username": "trung",
                    "comment": "i hope the murderer never get out of jail after this"
                },
                {
                    "username": "Hồ Vũ An",
                    "comment": "rip"
                },
                {
                    "username": "Sú",
                    "comment": "i hope the murderer will stay in jail forever"
                },
                {
                    "username": "Hồ Vũ An",
                    "comment": "Killing the LOOKS/VISUALS on this Jawn"
                }
            ]
        }
    ]
}